<?php
namespace sunny\components;
use common\models\LanguagePacket;

class EcoErrCode
{
    //错误码字典, 格式为6位数字
    //1***** 通用错误
    //2***** 用户相关错误
    //3***** 商品相关错误
    //4***** 订单相关错误
    //5***** 优惠相关错误
    //6***** 购物车相关错误
    //9***** 其他错误

    private $ERR_CODE_DICT = array(
        //通用错误
        '1' => '成功',
        '0000' => '成功',
        '100001' => '用户未登录',
        '100002' => '用户名或者密码不正确',
        '100003' => '发送注册验证码失败',
        '100004' => '手机号码格式不正确',
        '100005' => '验证码类型不正确',
        '100006' => '登录验证码不正确',
        '100007' => '登录验证码不正确',
        '100008' => '当前用户不存在',
        '100009' => '当前手机号码已注册',
        '100010' => '邀请码不正确',
        '100011' => '所填密码不能为空',
        '100012' => '两次所填密码一致',
        '100013' => '所填写注册验证码不正确',
        '100014' => '注册新账户失败',
        '100015' => '忘记密码短信验证码错误',
        '100016' => 'Google验证码验证失败',
        '100017' => '添加信息不完整',
        '100018' => '平台信息不正确',
        '100019' => 'api配置信息不能重复添加',
        '100020' => '绑定钱包地址不能为空',
        '100021' => '绑定钱包验证码错误',
        '100022' => '请勿重复绑定同一地址',
        '100023' => '绑定地址资源池已经枯竭',
        '100024' => '注册用户失败',
        '100025' => '入账地址为空，不需要同步',
        '100026' => "超出请求频率",
        '100027' => "矿机信息不存在",
        '100028' => "矿机信息已下架",
        '100029' => "库存不足",
        '100030' => "下单数量必须为正整数",
        '100031' => "创建订单失败",
        '100032' => "传递订单类型不正确",
        '100033' => "订单信息不存在",
        '100034' => "订单已超时，不允许超时",
        '100035' => "当前订单状态不允许支付",
        '100036' => "余额不足",
        '100037' => "付款失败",
        '100038' => "请前往个人中心设置资金密码",
        '100039' => "资金密码不正确",
        '100040' => "您已绑定，请勿重复绑定",
        '100041' => "您尚未绑定谷歌验证码",
        '100042' => "必填项不能为空",
        '100043' => "两次密码不一致",
        '100044' => "验证码不正确",
        '100045' => "短信验证码不正确",
        '100046' => "Google验证码不正确",
        '100047' => "图片验证码不能为空",
        '100048' => "图片验证码不正确",
        '100049' => "请先进行第一步验证",
        '100050' => "旧的谷歌验证码不正确",
        '100051' => "旧的谷歌验证码未验证通过",
        '100052' => "请填写必填信息",
        '100053' => "新手机号码已经存在，请勿重复绑定",
        '100054' => "旧手机号码验证码不正确",
        '100055' => "新手机号码验证码不正确",
        '100056' => "当前算力余额不足",
        '100057' => "请填写完整信息",
        '100058' => "旧密码不正确",
        '100059' => "两次密码不一致",
        '100060' => "短信验证码不正确",
        '100061' => "24小时内修改过资金密码，暂时不允许提现",
        '100062' => "提现金额不正确",
        '100063' => "提现金额超过可提上限",
        '100064' => "提现地址不能为空",
        '100065' => "资金密码不正确",
        '100066' => "图形验证码不正确",
        '100067' => "短信验证码不正确",
        '100068' => "邮箱不能重复注册",
        '100069' => "邮箱格式不正确",
        '100070' => "公司信息不正确",
        '100071' => "该邮箱账户不存在",
        '100072' => "重置密码验证码不正确",
        '100073' => "重置密码操作失败",
        '100074' => "当前语言不存在",
        '100075' => "当前设备信息不存在",
        '100076' => "当前设备已绑定",
        '100077' => "经纬度信息不能为空",
        '100078' => "设备名称不能为空",
        '100079' => "时间筛选参数不正确",
        '100080' => "年月日必传",
        '100081' => "年月必传",
        '100082' => "年必传",
        '100083' => "数值必须为0.15~10的数字",
        '100084' => "数值必须为1~4的整数",
        '100085' => "蓄电池类型数值必须为10或者11",
        '100086' => "系统电压传值不正确",
        "100087" => "亮灯计算总和不能超过1440分钟",
        "100088" => "项目编号不能重复",
        "100089" => "项目信息不存在",
        "100090" => "更新地址信息失败",
        "100091" => "保存配置失败",
        "100092" => "PN号已存在",
        "100093" => "用户昵称不能为空",
        "100094" => "用户昵称不能重复",
        "100095" => "上次任务尚未同步完成",

        //200001 其他业务
    );

    /**
     * 获取错误码
     * @param $code
     * @return string
     */
    public function get($code)
    {
        // 读取对应的缓存
        $language_package_obj = new  LanguagePacket();
        $msg = $language_package_obj->getInfoByKeyFromUser($code);
        if($msg){
            return  $msg ;
        }

        return isset($this->ERR_CODE_DICT[$code]) ? $this->ERR_CODE_DICT[$code] : "未知错误";
    }

}
