<?php
namespace backend\components;
class EcoErrCode
{
    //错误码字典, 格式为6位数字
    //1***** 通用错误
    //2***** 用户相关错误
    //3***** 商品相关错误
    //4***** 订单相关错误
    //5***** 优惠相关错误
    //6***** 购物车相关错误
    //9***** 其他错误

    private $ERR_CODE_DICT = array(
        //通用错误
        '1' => '成功',
        '0000' => '成功',
        '100001' => '用户未登录',
        '100002' => '非法访问！',
        '100003' => '非法参数',
        '100004' => '无权访问',
        '100005' => '数据操作失败',
        '100006' => '必填参数不能为空',
        '100007' => '活动开始时间不能大于结束时间',
        '100008' => '数据不存在',
        '100009' => '推送数据不能为空',
        '100010' => 'IP地址不在白名单内',
        // 资源相关
        "100101" => "请选择待上传的资源",
        "100102" => "资源格式不被允许",
        "100103" => "资源过大，请处理后重试",
        "100104" => "资源上传失败",
        "100105" => "资源同步失败",

        // 业务相关
        "200001" => "当前订单号已重复",
        "200002" => "当前用户邮箱为空，不能发送验证码",
        "200003" => "发送邮箱验证码失败",
        "200004" => "邮箱验证码不正确",
        "200005" => "邮箱验证码不正确",
        "200007" => "新增记录失败",
        "200008" => "当前文件类型不符合要求",
        "200009" => "上传数据记录不能为空",
        "200010" => "导入代付金额不正确",
        "200011" => "开户名不能为空",
        "200012" => "银行卡号不能为空",
        "200013" => "开户行省名称不能为空",
        "200014" => "开户行市名称不能为空",
        "200015" => "开户行地址不能为空",
        "200016" => "银行名称不能为空",
        "200017" => "银行卡号必须以out开头",
        "200018" => "开户行省信息不正确",
        "200019" => "开户行省信息不正确",
        "200020" => "请勿重复导入",
        "200021" => "同步记录失败",
        "200022" => "币种不符合要求，目前只支持CNY",
        "200023" => "支付方式不符合要求，目前只支持ALIPAY-支付宝 CARD-银行卡",
        "200024" => "当前手机号码对应的用户不存在",
        "200025" => "订单信息不存在",
        "200026" => "币种信息不正确",
        "200027" => "订单金额不正确",
        "200028" => "广告位的唯一key不能重复",
        "200029" => "当前开始结束时间段已存在有效的活动",
        "200030" => "手机号码已存在",
        "200031" => "没有可分配的地址池信息",
        "200032" => "新增用户失败",
        "200033" => "每T发放的收益必须数字",
        "200034" => "当前活动尚未开始或已结束，不允许发放收益",
        "200035" => "当前活动状态不允许发放收益",
        "200036" => "当日已发放，请勿重复发放",
        "200037" => "处理失败",
        "200038" => "必须为数字",
        "200039" => "每日增量总和不能超过总有效量",
        "200040" => "语言缩写不能重复",
        "200041" => "语言项key不能重复",
        "200042" => "新增语言项失败",
        "200043" => "选项值不能重复",
        "200044" => "合同号不能重复",
        "200045" => "公司的唯一key不能重复",
        "200046" => "设备分类的唯一key不能重复",
        "200047" => "生成数目必须为正整数",
        "200048" => "一次性最多只能生成99999个",
        "200049" => "亮度调节设置范围为0到100",
        "200050" => "超出当日允许数目上限",
        "200051" => "亮灯计算总和不能超过1440分钟",
        "200052" => "亮灯时长超出上限",

    );

    /**
     * 获取错误码
     * @param $code
     * @return string
     */
    public function get($code)
    {
        return isset($this->ERR_CODE_DICT[$code]) ? $this->ERR_CODE_DICT[$code] : "未知错误";
    }

}
